app/Validations/UserRules.php

    public function validateUser( $str, string $fields, array $data ):bool
    {
        $userModel  =   new User();
        $user       =   $userModel->where( 'email', $data[ 'emailFrm' ] )->first();
---
SELECT *
FROM `users`
WHERE `email` = 'nan@mail.com'
 LIMIT 1