app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `email` = 'nan@mail.com'
 LIMIT 1
---
    public function index()
    {
        helper( [ 'form' ] );

        $data   =   [
            'title'     =>  'Login'
        ];

        if ( $this->request->getMethod() == 'post'  ){
            $rules      =   [
                'emailFrm'      =>  'required|min_length[10]|valid_email',
                'pwdFrm'        =>  'required|min_length[3]|validateUser[emailFrm,pwdFrm]'
            ];
            $messages   =   [
                'emailFrm'      =>  [
                    'required'      =>  'Email is required!',
                    'min_length'    =>  'Email must have more than 3 characters',
                    'valid_email'   =>  'Email must be valid'
                ],
                'pwdFrm'      =>  [
                    'required'      =>  'Password is required!',
                    'min_length'    =>  'Password must have more than 3 characters',
                    'validateUser'   =>  'Your data does not match'
                ],
            ];
            if ( ! $this->validate( $rules, $messages ) ){
                $data[ 'validation' ]   =   $this->validator;
            }else{
                $userModel  =   new User();
                $user       =   $userModel->where( 'email', $this->request->getVar( 'emailFrm' ) )->first();

INSERT INTO `users` (`name`, `email`, `password`, `created_at`) VALUES ('Nan', 'nan@mail.com', '$2y$10$TXEdIKmvh5FUk8DlIPAAB.2PQrAR7vRCxWnoakGMkgLcGacz7Pcl2', '2023-06-27 17:17:07')
---
                ];

                try {
                    $userModel->save($newData);