app/Controllers/UserController.php

                    'password'  =>  $this->request->getVar( 'pwdFrm' ),
                ];

                $userModel->save( $newData );
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('miscapu', 'miscapu@mail.com', '123')